03_texturedPlate/02_transTexture/01_baseCaseInit/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          2400;
        startFace       3205800;
    }
    overInlet
    {
        type            patch;
        nFaces          4800;
        startFace       3208200;
    }
    outlet
    {
        type            patch;
        nFaces          7200;
        startFace       3213000;
    }
    plate
    {
        type            patch;
        nFaces          18000;
        startFace       3220200;
    }
    sides
    {
        type            patch;
        nFaces          18000;
        startFace       3238200;
    }
    atmosphere
    {
        type            patch;
        nFaces          18000;
        startFace       3256200;
    }
)

// ************************************************************************* //
